tiss-webservice/test/envio-anexo/fixtures/sucesso/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ans="http://www.ans.gov.br/padroes/tiss/schemas">
  <soap:Body>
    <ans:tissLoteAnexo_Operation>
      <ans:loteAnexoWS>
        <ans:cabecalho>
          <ans:identificacaoTransacao>
            <ans:tipoTransacao>ENVIO_ANEXO</ans:tipoTransacao>
            <ans:sequencialTransacao>123456789</ans:sequencialTransacao>
            <ans:dataRegistroTransacao>2024-01-15</ans:dataRegistroTransacao>
          </ans:identificacaoTransacao>
          <ans:origem>
            <ans:codigoOperadora>12345</ans:codigoOperadora>
            <ans:codigoRegistro>REG001</ans:codigoRegistro>
          </ans:origem>
          <ans:destino>
            <ans:codigoOperadora>67890</ans:codigoOperadora>
            <ans:codigoRegistro>REG002</ans:codigoRegistro>
          </ans:destino>
          <ans:Padrao>4.00.00</ans:Padrao>
          <ans:loginSenhaPrestador>
            <ans:loginPrestador>user123</ans:loginPrestador>
            <ans:senhaPrestador>pass123</ans:senhaPrestador>
          </ans:loginSenhaPrestador>
        </ans:cabecalho>
        <ans:loteAnexo>
          <ans:numeroLote>LOTE_ANX_20240115001</ans:numeroLote>
          <ans:codigoPrestador>PREST001</ans:codigoPrestador>
          <ans:anexos>
            <ans:sequencialItem>1</ans:sequencialItem>
            <ans:numeroGuia>GP20240115001</ans:numeroGuia>
            <ans:tipoAnexo>DOCUMENTO</ans:tipoAnexo>
            <ans:nomeArquivo>anexo1.pdf</ans:nomeArquivo>
            <ans:conteudoArquivo>JVBERi0xLjQKMSAwIG9iago8PAovVHlwZSAvQ2F0YWxvZwovUGFnZXMgMiAwIFIKPj4KZW5kb2JqCg==</ans:conteudoArquivo>
          </ans:anexos>
        </ans:loteAnexo>
        <ans:hash>mock_hash_value_123456789</ans:hash>
      </ans:loteAnexoWS>
    </ans:tissLoteAnexo_Operation>
  </soap:Body>
</soap:Envelope>
